Revit 2024 API
ComboBox.GetItems Method
Gets the copy of a collection of the ComboBoxMembers assigned to the ComboBox.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public IList<ComboBoxMember> GetItems()
Visual Basic
Public Function GetItems As IList(Of ComboBoxMember)
Visual C++
public:
IList<ComboBoxMember^>^ GetItems()
See Also
ComboBox Class
Autodesk.Revit.UI Namespace